# Brewfile - Homebrew Bundle
# To install: brew bundle install --file=Brewfile
# To update this file: brew bundle dump --file=Brewfile --force

# Taps
tap "aws/tap"
tap "homebrew/core"
tap "msoap/tools"

# Core utilities
brew "coreutils"
brew "git"
brew "gnupg"
brew "openssl@3"
brew "openssl@1.1"
brew "pwgen"
brew "watch"
brew "wget"

# Shell tools
brew "shellcheck"
brew "shfmt"

# Go development
brew "go"
brew "goenv"
brew "golangci-lint"

# Node.js development
brew "nvm"
brew "pnpm"
brew "yarn"

# Python
brew "python@3.14"

# AWS tools
brew "aws-sam-cli"
brew "aws-vault"
brew "chamber"

# Infrastructure / DevOps
brew "terraform", link: false
brew "terragrunt"
brew "tfenv"
brew "helm"
brew "helmfile"
brew "kustomize"
brew "kubeconform"
brew "hcloud"

# Kubernetes
brew "k9s"
brew "kind"

# Databases
brew "mariadb"
brew "mysql@8.4"
brew "postgresql@14"
brew "rabbitmq"
brew "redis"

# HTTP / API tools
brew "caddy"
brew "gh"
brew "hey"
brew "k6"
brew "shell2http"

# Build tools
brew "docker-compose"
brew "just"

# Linting / Formatting
brew "yamllint"
brew "yq"

# Casks (GUI applications)
cask "docker-desktop"
cask "mysqlworkbench"
cask "spectacle"

# VS Code extensions
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "justusadam.language-haskell"
vscode "mhutchie.git-graph"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tidalcycles.vscode-tidalcycles"
vscode "timonwong.shellcheck"

# Go packages (installed via go install)
go "golang.org/x/tools/gopls"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "honnef.co/go/tools/cmd/staticcheck"
go "go.k6.io/xk6/cmd/xk6"
