anthropic.claude-code
bierner.markdown-mermaid
cweijan.dbclient-jdbc
cweijan.vscode-mysql-client2
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
github.vscode-github-actions
golang.go
hashicorp.hcl
hashicorp.terraform
haskell.haskell
justusadam.language-haskell
mhutchie.git-graph
mkhl.shfmt
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-vscode.makefile-tools
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
tidalcycles.vscode-tidalcycles
timonwong.shellcheck
